<?php

namespace Mrwang211\PinyinPro;

class ToneMap
{
    public const array DEFAULT_TONE_MAP = [
        'a' => ['a', 'ā', 'á', 'ǎ', 'à'],
        'e' => ['e', 'ē', 'é', 'ě', 'è'],
        'o' => ['o', 'ō', 'ó', 'ǒ', 'ò'],
        'r' => ['r', 'r̄', 'ŕ', 'ř', 'r̀'],
        'ü' => ['ü', 'ǖ', 'ǘ', 'ǚ', 'ǜ'],
        'v' => ['ü', 'ǖ', 'ǘ', 'ǚ', 'ǜ'],
        'ui' => ['ui', 'uī', 'uí', 'uǐ', 'uì'],
        'iu' => ['iu', 'iū', 'iú', 'iǔ', 'iù'],
        'i' => ['i', 'ī', 'í', 'ǐ', 'ì'],
        'u' => ['u', 'ū', 'ú', 'ǔ', 'ù'],
        'n' => ['n', 'n̄', 'ń', 'ň', 'ǹ'],
        'm' => ['m', 'm̄', 'ḿ', 'm̌', 'm̀'],
        'ê' => ['ê', 'ê̄', 'ế', 'ê̌', 'ề'],
    ];
}
